package load;

import load.jopo.*;

import java.util.Scanner;
public class LoadDemo {
    static Blue[] blue = new Blue[31];
    public static void main(String[] args) {
        bchu();
        Scanner sr=new Scanner(System.in);
        Epigraph[] a=new Epigraph[93];
        Users[] b=new Users[30];

        Orange[] orange = new Orange[31];
        Green[] green = new Green[31];
        showb();
    }

    public static void bchu(){
        Blue bl = new Blue( "活力","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[0] = bl;
        bl = new Blue( "治疗","蓝色",1,0,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  3, 0);
        blue[1] = bl;
        bl = new Blue( "疾行","蓝色",1,0,0,0,0,0,0,  0,  0,  0,  0,  0,  0,  3);
        blue[2] = bl;
        bl = new Blue( "刚毅","蓝色",2,30,0,   0,  0,  0,  40,  0,  0,  0,  0,  0,  0,0  );
        blue[3] = bl;
        bl = new Blue( "吸收","蓝色",2,0,40,   0,  0,  0,  0,  40,  0,  0,  0,  0,  0,0);
        blue[4] = bl;
        bl = new Blue( "生长","蓝色",2,0,0,   0,  0,  0,  0,  0,  21,  0,  0,  0,  0, 0 );
        blue[5] = bl;
        bl = new Blue( "愈合","蓝色",2,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  420,0  );
        blue[6] = bl;
        bl = new Blue( "强健","蓝色",3,40,0,   0,  0,  0,  0,  0,  24,  0,  0,  0,  0, 0 );
        blue[7] = bl;
        bl = new Blue( "感应","蓝色",3,40,80,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[8] = bl;
        bl = new Blue( "绽放","蓝色",3,0,0,   0,  0,  0,  0,  0,  12,  0,  0,  0,  420, 0 );
        blue[9] = bl;
        bl = new Blue( "神速","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[10] =bl;
        bl = new Blue( "饮血","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[11] =bl;
        bl = new Blue( "转换","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[12] =bl;
        bl = new Blue( "渴血","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[13] =bl;
        bl = new Blue( "正义","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[14] = bl;
        bl = new Blue( "气数","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[15] =bl;
        bl = new Blue( "刹那","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[16] =bl;
        bl = new Blue( "复苏","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[17] = bl;
        bl = new Blue( "滋生","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[18] =bl;
        bl = new Blue( "急救","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[19] =bl;
        bl = new Blue( "吞噬","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[20] = bl;
        bl = new Blue( "轮回","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[21] = bl;
        bl = new Blue( "隐匿","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[22] =bl;
        bl = new Blue( "长生","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[23] = bl;
        bl = new Blue( "兽痕","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[24] = bl;
        bl = new Blue( "冥想","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[25] = bl;
        bl = new Blue( "调和","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[26] = bl;
        bl = new Blue( "繁荣","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[27] = bl;
        bl = new Blue( "狩猎","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[28] = bl;
        bl = new Blue( "贪婪","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[29] = bl;
        bl = new Blue( "夺萃","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[30] = bl;



    }

    public static void showb(){
        for(int i=0;i<blue.length;i++){
            System.out.println(blue[i].getEname());
        }
    }
    public static void achu(){
        Blue bl = new Blue( "活力","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[0] = bl;
        bl = new Blue( "治疗","蓝色",1,0,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  3, 0);
        blue[1] = bl;
        bl = new Blue( "疾行","蓝色",1,0,0,0,0,0,0,  0,  0,  0,  0,  0,  0,  3);
        blue[2] = bl;
        bl = new Blue( "刚毅","蓝色",2,30,0,   0,  0,  0,  40,  0,  0,  0,  0,  0,  0,0  );
        blue[3] = bl;
        bl = new Blue( "吸收","蓝色",2,0,40,   0,  0,  0,  0,  40,  0,  0,  0,  0,  0,0);
        blue[4] = bl;
        bl = new Blue( "生长","蓝色",2,0,0,   0,  0,  0,  0,  0,  21,  0,  0,  0,  0, 0 );
        blue[5] = bl;
        bl = new Blue( "愈合","蓝色",2,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  420,0  );
        blue[6] = bl;
        bl = new Blue( "强健","蓝色",3,40,0,   0,  0,  0,  0,  0,  24,  0,  0,  0,  0, 0 );
        blue[7] = bl;
        bl = new Blue( "感应","蓝色",3,40,80,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[8] = bl;
        bl = new Blue( "绽放","蓝色",3,0,0,   0,  0,  0,  0,  0,  12,  0,  0,  0,  420, 0 );
        blue[9] = bl;
        bl = new Blue( "神速","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[10] =bl;
        bl = new Blue( "饮血","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[11] =bl;
        bl = new Blue( "转换","蓝色",3,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[12] =bl;
        bl = new Blue( "渴血","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[13] =bl;
        bl = new Blue( "正义","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[14] = bl;
        bl = new Blue( "气数","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[15] =bl;
        bl = new Blue( "刹那","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[16] =bl;
        bl = new Blue( "复苏","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[17] = bl;
        bl = new Blue( "滋生","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[18] =bl;
        bl = new Blue( "急救","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[19] =bl;
        bl = new Blue( "吞噬","蓝色",4,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[20] = bl;
        bl = new Blue( "轮回","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[21] = bl;
        bl = new Blue( "隐匿","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[22] =bl;
        bl = new Blue( "长生","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[23] = bl;
        bl = new Blue( "兽痕","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0  );
        blue[24] = bl;
        bl = new Blue( "冥想","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[25] = bl;
        bl = new Blue( "调和","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[26] = bl;
        bl = new Blue( "繁荣","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[27] = bl;
        bl = new Blue( "狩猎","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[28] = bl;
        bl = new Blue( "贪婪","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[29] = bl;
        bl = new Blue( "夺萃","蓝色",5,0,0,   0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0 );
        blue[30] = bl;
    }
}
